[
  {
    "id": 7,
    "projectTitle": "PlanX",
    "category": "Education Website",
    "description": "The webpage was made as a first-semester group exam project on EASV Esbjerg. The task was to create an interactive educational webpage rolving around the topic of space. We chose to showcase the subject of exoplanets and far distance space travel. The webpage recieved a maximum grade. ",
    "myRole": "I was the lead developer, I also participated heavily in the design process of the page and initial user research",
    "videoSrc": "",
    "pageLink": "https://planx-interstellar.netlify.app/",
    "sourceLink": "https://github.com/julczka/planX",
    "imgCover": "projects/code/1/planX1.jpg",
    "images": [
      "projects/code/1/planxlap3d.jpg",
      "projects/code/1/planx2-min.jpg",
      "projects/code/1/planxmobrender-min.jpg"
    ]
  },
  {
    "id": 8,
    "projectTitle": "Rhei",
    "category": "Mental health app prototype",
    "description": "Rhei is a mobile application prototype aimed to improve the mental wellbeing of its users and to connect them. It was an exam project in the second semester of my study progamme, developed within 3 weeks long sprint. The design process included ideas for different features and their user flow, creating a brand identity for the product, and developing an application’s user interface prototype. Vala Heath, a British telemedicine company, and it's CEO Pete Trainor was acting as our major stakeholder during the design and development process. The project received a maximum grade. ",
    "myRole": "I was the lead developer. Among my tasks were: animations, color theming, the \"calm down\" feature, and chat integration. I also participated heavily in the design process of the page and initial user research.",
    "videoSrc": "https://rhei-prototype.netlify.app/",
    "pageLink": "https://rhei-prototype.netlify.app/",
    "sourceLink": "https://github.com/team-awesome-EASV/rhei",
    "imgCover": "projects/code/2/rhei-logo-black.png",
    "images": []
  },
  {
    "id": 9,
    "projectTitle": "Portfolio",
    "category": "My personal webpage",
    "description": "Designing and developing the page you're on now was a very pleasant task. Not only did I manage to implement interesting libraries, like the Green Sock JS animation library or swiper.js, but I also wrote some elegant custom solutions. Among those is the fluent change between day and night mode,  and responsive, animated background.",
    "myRole": "Design and development",
    "videoSrc": "",
    "pageLink": "",
    "sourceLink": "https://github.com/julczka/portfolio-ok",
    "imgCover": "projects/code/3/portfolio-mock.png",
    "images": []
  },
  {
    "id": 10,
    "projectTitle": "",
    "category": "",
    "description": "",
    "myRole": "",
    "videoSrc": "",
    "pageLink": "",
    "sourceLink": "",
    "imgCover": "",
    "images": []
  },
  {
    "id": 11,
    "projectTitle": "",
    "category": "",
    "description": "",
    "myRole": "",
    "videoSrc": "",
    "pageLink": "",
    "sourceLink": "",
    "imgCover": "",
    "images": []
  },
  {
    "id": 12,
    "projectTitle": "",
    "category": "",
    "description": "",
    "myRole": "",
    "videoSrc": "",
    "pageLink": "",
    "sourceLink": "",
    "imgCover": "",
    "images": []
  }
]
