[
  {
    "dateLabel": "2005",
    "title": "PRODUCTION MANAGER @ <a href=\"https://www.tvn.pl/\" target=\"blank\" class=\"timeline-link\"> <u>TVN</u> </a>",
    "description": "Postproduction supervision of various shows: Superniania (reality show) , Misja Martyna (travel)."
  },
  {
    "dateLabel": "2008",
    "title": "ON-AIR PROMOTION PRODUCER @ <a href=\"https://tvn24.pl/tvnwarszawa/\" target=\"blank\" class=\"timeline-link\"> <u>TVN WARSZAWA</u> </a>",
    "description": "Creative director of on-air promotions in local Warsaw TV channel TVN Warszawa (closed down). My main tasks were creating promos for all the programs aired on the TVN Warszawa Channel. That included writing scripts, editing clips, directing voice-over artists, and implementing the channel’s graphic design to create attractive and clear marketing communication. "
  },
  {
    "dateLabel": "2010",
    "title": "PRODUCER @ <a href=\"http://www.badibadi.com/\" target=\"blank\" class=\"timeline-link\"> <u>BADI BADI FX STUDIO</u> </a> and BOX POSTPRODUCTION",
"description": "I was planning, budgeting, and managing postproduction processes in many commercial projects like advertising films and corporate videos, often more than one at a time. Not only did it require specific and expert knowledge of film postproduction, VFX, and 3D animation, but also the ability to keep good relationships with highly demanding clients as well as managing and coordinating a team of artists with little space for errors and always under a lot of pressure."  },

  {
    "dateLabel": "2013",
    "title": "DIRECTOR @ <a href=\"https://www.tvnstyle.pl/\" target=\"blank\" class=\"timeline-link\"> <u>TVN STYLE</u> </a>",
"description": "Preparing scripts, directing shows: “66 niezapomnianych” (2013 - 2015), “Pani gadżet” (2015 - 2016), “Bez skazy” (2016). I was responsible for writing scripts for the TV shows mentioned above, planning, and executing work on the film set, also for collaborating with video editors in the postproduction process under the pressure of on-air deadlines. Working on the TV set has given me the necessary skills for working in a dynamic environment and quickly adapt to changes."  },
  {
    "dateLabel": "2016",
    "title": "ONLINE VIDEO JOURNALIST/EDITOR @ <a href=\"https://www.wp.pl/\" target=\"blank\" class=\"timeline-link\"> <u>WIRTUALNA POLSKA</u> </a>",
    "description": "I was responsible for creating video content in form of short films for the leading Polish portal www.wp.pl. My tasks included, research, writing a short script about topics such as current events, science, or lifestyle, and editing a clip in Adobe Premiere Pro, mostly from stock footage, according to the aforementioned script."
  },
  {
    "dateLabel": "2019",
    "title": "MULTIMEDIA DESIGN STUDENT @ <a href=\"https://www.easv.dk/da/\" target=\"blank\" class=\"timeline-link\"> <u>EASV</u> </a>",
"description": "The AP degree in Multimedia Design & Communication is a skill-oriented two years long higher education consisting of creative, communicative, business, and design themes. Visual communication and interaction design are core elements. The students learn how to apply this knowledge to create interactive and noninteractive media products. The academy works closely with the business community and also encourages a global perspective for students and faculty. The multimedia design programme is built on four core areas: business, communication and presentation, interaction development, and design and visualization. We learn about designing games, web portals, and mobile services in addition to digital video, 3D, and databases."  }
]
