[
  {
    "dateLabel": "2005",
    "title": "PRODUCTION MANAGER @ TVN",
    "description": "Postproduction supervision of various shows: Superniania , Misja Martyna."
  },
  {
    "dateLabel": "2008",
    "title": "ON-AIR PROMOTION PRODUCER @ TVN WARSZAWA",
    "description": "Creative director of on-air promotions in local Warsaw TV channel TVN Warszawa (closed down).  My main tasks were creating promos for all the programs aired on the TVN Warszawa Channel. That included writing scripts, editing clips, directing voice over artists, and implementing the channel’s graphic design to create attractive and clear marketing communication."
  },
  {
    "dateLabel": "2010",
    "title": "PRODUCER @ BADI BADI FX STUDIO",
    "description": "Planning, budgeting, video and audio postproduction supervision in tv commercials. I was managing postproduction processes in many commercial projects like advertising films and corporate videos, often more than one at the time. Not only did it require specific and expert knowledge of film postproduction, but also the ability to keep good relationships with highly demanding clients as well as managing and coordinating a team of artists with little space for errors and always under a lot of pressure."
  },
  {
    "dateLabel": "2012",
    "title": "POSTPRODUCTION MANAGER @ BOX POSTPRODUCTION",
    "description": "Planning, budgeting, video and audio postproduction supervision in tv commercials. I was managing postproduction processes in many commercial projects like advertising films and corporate videos, often more than one at the time. Not only did it require specific and expert knowledge of film postproduction, but also the ability to keep good relationships with highly demanding clients as well as managing and coordinating a team of artists with little space for errors and always under a lot of pressure. "
  },
  {
    "dateLabel": "2013",
    "title": "DIRECTOR @ TVN STYLE",
    "description": "Preparing scripts, directing shows:  '66 niezapomnianych' (2013 - 2015), 'Pani gadżet' (2015 - 2016), 'Bez skazy' (2016). I was responsible for writing scripts for the TV shows mentioned above, planning, and executing work on the film set, also for collaborating with video editors in the postproduction process under the pressure of on-air deadlines. Working on the TV set has given me necessary skills for working in dynamic environment and quickly adapt to changes."
  },
  {
    "dateLabel": "2016",
    "title": "ONLINE VIDEO JOURNALIST/EDITOR @ WIRTUALNA POLSKA",
    "description": "Creating video content in form of short films for leading Polish portal www.wp.pl. I was responsible for writing a short script about topics such as current events, science, or lifestyle based on the research I had done and editing a clip in Adobe Premiere Pro, mostly from stock footage according to aforementioned script."
  },
  { "dateLabel": "2019", "title": "MULTIMEDIA DESIGN STUDENT @ EASV" }
]
